index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>COE301 NOTES</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">COE301 NOTES</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d2689a">Resources</a></li>
<li><a href="#org32424f5">Mips assembly</a>
<ul>
<li><a href="#orgecd665a">Introduction</a>
<ul>
<li><a href="#org8ed7c48">Hello, World</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org7d2689a" class="outline-2">
<h2 id="org7d2689a">Resources</h2>
<div class="outline-text-2" id="text-org7d2689a">
<ul class="org-ul">
<li>Github repositary of this document <a href="https://github.com/Airbus5717/coe301">repo</a></li>
<li>if you find any issue, report it here <a href="https://github.com/Airbus5717/coe301/issues">report issue</a></li>
<li>Mars mips simulator <a href="https://courses.missouristate.edu/KenVollmar/mars/download.htm">link</a></li>
<li>Dr. Mudawwar&rsquo;s videos <a href="https://youtube.com/playlist?list=PLeurb_BIjrxjSmBhm_h3TkN8pWxM_1ViU">link</a></li>
<li>Mips assembly videos <a href="https://www.youtube.com/playlist?list=PL1C2GgOjAF-KYdV5bH-xzoybEHreDZ3Kh">Padraic Edgington</a></li>
<li>Mips assembly videos <a href="https://www.youtube.com/playlist?list=PL5b07qlmA3P6zUdDf-o97ddfpvPFuNa5A">Amell Peralta</a></li>
<li>Mips assembly Slides from oregon state uni <a href="https://web.engr.oregonstate.edu/~walkiner/cs271-wi13/slides/">class 2013</a></li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org32424f5" class="outline-2">
<h2 id="org32424f5">Mips assembly</h2>
<div class="outline-text-2" id="text-org32424f5">
</div>
<div id="outline-container-orgecd665a" class="outline-3">
<h3 id="orgecd665a">Introduction</h3>
<div class="outline-text-3" id="text-orgecd665a">
</div>
<ul class="org-ul">
<li><a id="org7f60470"></a>Mars simulator Setup<br />
<div class="outline-text-5" id="text-org7f60470">
<ol class="org-ol">
<li>File (or Ctrl-N) -&gt; New File</li>
<li>Copy paste the code below</li>
<li>Save the file (or Ctrl-S)</li>
<li>Run (or F3) -&gt; Assemble</li>
<li>If assembling was successful then continue</li>
<li>Go (or F5) to run the whole program at once</li>
</ol>
</div>
</li>
</ul>


<div id="outline-container-org8ed7c48" class="outline-4">
<h4 id="org8ed7c48">Hello, World</h4>
<div class="outline-text-4" id="text-org8ed7c48">
<div class="org-src-container">
<pre class="src src-mips"><span style="color: #928374;"># </span><span style="color: #b8bb26; font-weight: bold;">NOTE:</span><span style="color: #928374;"> Hello, World in assembly</span>
<span style="color: #ebdbb2; font-weight: bold;">.globl</span> main

<span style="color: #928374;"># </span><span style="color: #928374;">data segment (global variables)</span>
<span style="color: #ebdbb2; font-weight: bold;">.data</span>
<span style="color: #b8bb26;">msg:</span> <span style="color: #ebdbb2; font-weight: bold;">.asciiz</span> <span style="color: #b8bb26;">"Hello, World\n"</span>
    <span style="color: #928374;"># </span><span style="color: #928374;">asciiz includes the null terminator (\0) in string</span>

<span style="color: #928374;"># </span><span style="color: #928374;">code segment</span>
<span style="color: #ebdbb2; font-weight: bold;">.text</span>
<span style="color: #b8bb26;">main:</span>
    <span style="color: #928374;"># </span><span style="color: #928374;">print string msg</span>
    <span style="color: #83a598;">la</span> <span style="color: #fabd2f;">$a0</span><span style="color: #fe8019;">,</span> msg <span style="color: #928374;"># </span><span style="color: #928374;">loads address of msg to $a0</span>
    <span style="color: #83a598;">li</span> <span style="color: #fabd2f;">$v0</span><span style="color: #fe8019;">,</span> <span style="color: #d3869b; font-weight: bold;">4</span>   <span style="color: #928374;"># </span><span style="color: #928374;">loads immediate (4) to $v0</span>
    <span style="color: #fb4934;">syscall</span>

    <span style="color: #928374;"># </span><span style="color: #928374;">exit</span>
    <span style="color: #83a598;">li</span> <span style="color: #fabd2f;">$v0</span><span style="color: #fe8019;">,</span> <span style="color: #d3869b; font-weight: bold;">10</span>
    <span style="color: #fb4934;">syscall</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>